kong/plugins/soap-request-transformer/example-soap.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><getCountryRequest xmlns="http://spring.io/guides/gs-producing-web-service"><somethingElse>test</somethingElse><anotherThing>thing2</anotherThing><name>Spain</name></getCountryRequest></soap:Body></soap:Envelope>