src/main/resources/country-request.xml

<!--  EXAMPLE Request used in postman to get data from given country  -->
<!--  Header is made to conform the username & password required by added security  -->
<!--  POST: http://localhost:8080/soap-ws  -->
<!--  Header-key: Content-Type - Header-value: text/xml  -->
<!--  Body:  -->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>user</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <gs:getCountryRequest>
            <gs:name>Belgium</gs:name>
        </gs:getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>